#Задание 1  Задача «Часть от целого».
Text = 'Сейчас на Земле появился новый вид роботов. Раньше их называли „железной оравой “, но это не очень точное определение'

print(Text[0:44])