#Задание 4: Задача «Четные и нечетные».
Text = "нейропрограммирование"

print(Text[::2] + "\n" + Text[1::2]) # все символы с четными и нечетными индексами

